app/controllers/feeds_controller.rb

  def index
    # Retrieve the list of moves from the Address Change table, to be used by the RSS feed
    @changes = AddressChange.all(:order => 'created_at desc', :limit => 50)
---
SELECT * FROM "address_changes" ORDER BY created_at desc LIMIT 50