app/controllers/friendships_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def index
    @user = User.find(params[:user_id])