app/controllers/users_controller.rb

  def index
    if params[:friends_only]
      @users = current_user.friends
    else
      @users = User.find(:all)
    end

    @map = GMap.new("map_div")
    @map.control_init(:large_map => true,:map_type => true)
    if current_user.geo_coords
      @map.center_zoom_init(current_user.geo_coords,4)
    else
      @map.center_zoom_init([75.6,-42.467],4)
    end

    for user in @users
      @map.overlay_init(GMarker.new(user.geo_coords, :title => "#{user.first_name} #{user.last_name}", :info_window => render_to_string(:partial => 'info_window', :locals => {:user => user}))) if user.geo_coords
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "users"

  def create
    @user = User.new(params[:user])
    @user.build_address(params[:address])

    respond_to do |format|
      if @user.save
---
INSERT INTO "addresses" ("city", "zip", "latitude", "updated_at", "street1", "street2", "user_id", "longitude", "state", "created_at") VALUES('Bedford', '76021', 32.847023, '2009-01-21 01:44:26', '2521 Stonegate Dr. North', '', 4, -97.159102, 'TX', '2009-01-21 01:44:26')
INSERT INTO "users" ("updated_at", "photo_file_name", "photo_file_size", "crypted_password", "password_salt", "admin", "photo_updated_at", "photo_content_type", "phone", "persistence_token", "first_name", "last_name", "email", "created_at") VALUES('2009-01-21 01:44:25', NULL, NULL, '9299afd20af5fbba97781b5b1111a9a861dce6216d7f5df7f90044a40bb046eb001b2103c7ad107978e9fac6839dd9424230ba1e42c65a61a5467579915a1159', '110d32e634be6720a55042a0d82e00d29d7f30a4aa5b6f8485a9645a82864f0c3431b29f2b7c86c2364eed7dc776bd0614a302dba91f7c3038c0b9df8915d32d', NULL, NULL, NULL, '', 'e146526b914545df119b5b1e710856b07b241ce84c0751e34ba2f7c35fd623410715129cb3624c0dc23df4ca6257b23a5d6ff9b5eceb76adbaa282a5bda1b60a', 'Jessica', 'Winter', 'jwinter@pobox.com', '2009-01-21 01:44:25')

  def update
    @user = User.find(params[:id])
    @address = @user.address || @user.build_address

    respond_to do |format|
      if @user.update_attributes(params[:user]) && @address.update_attributes(params[:address])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "addresses" SET "latitude" = 40.034874, "longitude" = -83.04701, "street2" = '', "zip" = '43220', "city" = 'Columbus', "street1" = '1121 Millcreek Ln', "state" = 'OH', "updated_at" = '2009-01-20 19:19:30' WHERE "id" = 2
UPDATE "users" SET "photo_content_type" = 'image/jpeg', "photo_file_name" = 'IMG_1730.JPG', "photo_updated_at" = '2009-01-20 21:05:38', "photo_file_size" = 2657663, "updated_at" = '2009-01-20 21:05:38' WHERE "id" = 1

  def update_friends
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1